WindowsFormsApp1/Resources/AdministrarClientes-Desvincular-Empresa-Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.tibco.com/schemas/Clientes/Resources/EIM/Common/Schema.xsd" xmlns:ser="http://www.compensar.com/services_psa080_administrarclientes">
   <soapenv:Header>
      <sch:headerMessage>
         <sch:userName>1022948279</sch:userName>
         <sch:idAplicacion>SWPR108</sch:idAplicacion>
      </sch:headerMessage>
   </soapenv:Header>
   <soapenv:Body>
      <ser:CrearVinculacionClienteRequest>
         <credenciales/>
         <crearVinculacionCliente>
            <cliente>
               <legalID>900877788</legalID>
               <tipoIdentificacion>2</tipoIdentificacion>
               <id>9999805069127038</id>
               <datosEmpresa>
                  <razonSocial>-</razonSocial>
                  <nombreComercial>-</nombreComercial>
                  <motivoInactivacion>
                     <id>0</id>
                  </motivoInactivacion>
               </datosEmpresa>
               <sucursal>
                  <id>0</id>
                  <sucursalID>0</sucursalID>
                  <centroCostosID>0</centroCostosID>
               </sucursal>
               <contacto>
                  <tipoContacto>-</tipoContacto>
                  <orden>-1</orden>
               </contacto>
               <afiliacion>
                  <cantidadVinculacion>4</cantidadVinculacion>
                  <categoriaAfiliacion>K</categoriaAfiliacion>
                  <motivoRetiro>
                     <id>7</id>
                     <nombre>-</nombre>
                  </motivoRetiro>
                  <clienteResponsable>
                     <tipoResponsable>1</tipoResponsable>
                     <centroCostosID>0</centroCostosID>
                     <sucursalID>0</sucursalID>
                     <id>0</id>
                     <nombre>Persona</nombre>
                     <legalID>0</legalID>
                     <tipoIdentificacion>0</tipoIdentificacion>
                  </clienteResponsable>
                  <clienteResponsable>
                     <tipoResponsable>2</tipoResponsable>
                     <centroCostosID>0</centroCostosID>
                     <sucursalID>0</sucursalID>
                     <id>0</id>
                     <nombre>Empresa</nombre>
                     <legalID>0</legalID>
                     <tipoIdentificacion>0</tipoIdentificacion>
                  </clienteResponsable>
                  <clienteResponsable>
                     <tipoResponsable>3</tipoResponsable>
                     <centroCostosID>0</centroCostosID>
                     <sucursalID>0</sucursalID>
                     <id>0</id>
                     <nombre>Sucursal</nombre>
                     <legalID>0</legalID>
                     <tipoIdentificacion>0</tipoIdentificacion>
                  </clienteResponsable>
                  <clienteResponsable>
                     <tipoResponsable>4</tipoResponsable>
                     <centroCostosID>0</centroCostosID>
                     <sucursalID>0</sucursalID>
                     <id>0</id>
                     <nombre>Centro de Costos</nombre>
                     <legalID>0</legalID>
                     <tipoIdentificacion>0</tipoIdentificacion>
                  </clienteResponsable>
                  <cmnt>A</cmnt>
                  <actualizadoEstado>true</actualizadoEstado>
                  <finFecha>2020-11-15T00:00:00</finFecha>
                  <ingresoEmpresaFecha>2020-11-01T00:00:00</ingresoEmpresaFecha>
                  <inicioFecha>2020-11-01T00:00:00</inicioFecha>
                  <modificacionFecha>0001-01-01T00:00:00</modificacionFecha>
                  <registroFecha>0001-01-01T00:00:00</registroFecha>
                  <retiroFecha>2020-11-15T00:00:00</retiroFecha>
                  <valorVinculacion>0</valorVinculacion>
                  <variableRetiro>CRETEMP</variableRetiro>
                  <programa>
                     <condicion>1</condicion>
                     <id>1011</id>
                     <tipoParentesco>EM</tipoParentesco>
                     <sigla>CJ</sigla>
                     <nombrePrograma>Empresas Afiliadas Caja</nombrePrograma>
                     <esPersona>true</esPersona>
                     <requisitos/>
                  </programa>
                  <id>24633637</id>
                  <clienteID>9999805069127038</clienteID>
               </afiliacion>
               <programa>
                  <id>-1</id>
                  <clientePropietarioID>0</clientePropietarioID>
               </programa>
            </cliente>
            <atributosComunes/>
         </crearVinculacionCliente>
      </ser:CrearVinculacionClienteRequest>
   </soapenv:Body>
</soapenv:Envelope>